# coding: utf-8
DEFAULT_STATE = 'menu'

WELCOME_MSG = """Привіт, обери пункт:
- bill (інтернет у гуртожитках)
- eduroam (інтернетах у корпусах / холлах гуртожитків)
- інше"""
ERROR_MSG = """Нажаль, місце, у яке Ви потрапили, не існує.
Ми забепечимо Ваше повернення у меню і обов'язково розглянемо цю помилку."""
HOWTO_EXIT_MSG = """Для повернення на початок у будь-який момент напишіть меню."""
YES_NO_ERROR_MSG = """Будь ласка, оберіть відповідь: так або ні. Для повернення напишіть меню."""

BILL_MSG = """Ви підключаєтесь вперше? так/ні"""
BILL_FIRST_FUCK_MSG = """Ви маєте акаунт у Bill?"""
BILL_FIRST_ROUTER_MSG = """"""
BILL_FIRST_ACCOUNT_MSG = """"""
BILL_ROUTER_SETTINGS = """"""