# coding: utf-8
DEFAULT_STATE = 'menu'

WELCOME = """Привіт, обери пункт:
- bill (інтернет у гуртожитках)
- eduroam (інтернетах у корпусах / холлах гуртожитків)
- інше"""
ERROR = """Нажаль, місце, у яке тобі довелося втрапити, не існує.
Ми про це не забудемо, а поки що перенаправляємо у меню."""
HOWTO_EXIT = """Для повернення на початок у будь-який момент напиши меню."""
YES_NO_ERROR = """Будь ласка, обери відповідь: так або ні. Для повернення напиши меню."""

BILL = """Підключаєшся вперше? так/ні"""

BILL_FIRST_ROOM_CABLE = """Знайди у своїй кімнаті кабель для підключення до Інтернету.
Виглядає приблизно як на зображенні.
Вдалося знайти?"""
BILL_CABLE_NOT_FOUND = """Пошукайте уважніше, уважно подивіться за меблями і т.д. Покличте на допомогу сусідів.
Вдалося знайти?"""
BILL_NO_CABLE_REDIRECT = """Якщо досі не вдалося знайти, попроси допомоги у студради або попитай знайомих.
На крайній випадок звертайся у Інформаційно-обчислювальний центр."""
BILL_FIRST_FUCK = """У тебе є акаунт у Bill? так/ні/не знаю"""
BILL_REGISTER = """Акаунт в Bill - це обліковий запис, через який ти будеш входити в Інтернет.
Аби зареєструватися слідуйте в ІОЦ - Інформаційно-обчислювальний центр, що знаходиться у корпусі кібернетиків та соціологів, вхід із заднього двору.
Розповсюджена практика реєструвати один акаунт на кімнату (а, отже, платити менше), проте врахуй, що можливе лише одне підключення одночасно (для декількох людей/пристроїв знадобиться роутер або комутатор).
Тільки не забудь домовитися з сусідами, орієнтовна плата за всіх разом на місяць - 60 грн.
Для реєстрації потрібно буде написати невелику заяву, тож візьми звичайний подвійний листок і ручку.

Після реєстрації ти отримаєш логін та пароль і зможеш залогінитись на https://bill.univ.kiev.ua.
Проте це ще не все. Тобі потрібно буде поповнити рахунок, аби почати користуватися Інтернетом."""
BILL_ICC = """Як дістатися Інформаційно-обчислювального центру?

Корпус знаходиться на ВДНГ (Виставковому центрі), за адресою просп. Академіка Глушкова, 4д.
На фото зображено 3 корпуси, потрібний тобі - посередині. Входь ззаду, не через центральний вхід.
На другому фото можеш побачити як виглядає вхід в ІОЦ.

Після входу в корпус слідуй направо, прямо до дверей."""
BILL_ADMIN_CONTACTS = """контакти приймальні адміна біллу"""

BILL_CHECK_IF_ACCOUNT = """Якщо ти реєструвався/подав заяву в Інформаційно-обчислювальному центрі, то в тебе є такий акаунт.
Або реєструвався хтось із сусідів і ви збираєтесь користуватись інтернетом разом (спитай у них).
Також можеш спробувати залогінитись на https://bill.univ.kiev.ua.

Якщо акаунт все ще знайти не вдалось, то вкажи, що не маєш такого."""

BILL_FIRST_ROUTER = """Тобі потрібно налаштувати роутер? Якщо використовуєш комутатор або пряме підключення до комп'ютера, обери ні."""
BILL_ROUTER_SETTINGS = """налаштування роутера. Тобі вдалося налаштувати роутер?"""
BILL_ROUTER_CONFIG_ERROR = """Не переймайся, вихід є. Пошукай знайомих з подібним роутером, спробуй адаптувати налаштування під нього або звернися до адміну bill."""
BILL_FIRST_COMPUTER = """Тобі потрібно налаштувати комп'ютер? Обери так, якщо використовуєш комутатор або пряме підключення."""
BILL_COMPUTER_SETTINGS = """налаштування комп'ютера. Тобі вдалося налаштувати комп'ютер?"""
BILL_COMPUTER_CONFIG_ERROR = """Не переймайся, вихід є. Пошукай знайомих з подібною ОС, спробуй повторити налаштування з ними або звернись в ІОЦ чи до адміна."""
BILL_SHOULD_WORK = """Bill вже має працювати. Якщо це не так, перейди до підменю Проблеми."""

BILL_PAY = """Наразі вартість складає 2 грн/добу за 100 Мб/с, перевірити тарифи можна на сайті http://bill.univ.kiev.ua.
Свій номер для поповнення можна глянути в особистому кабінеті на https://bill.univ.kiev.ua.
Методи поповнення:
- приват24 - швидко і невелика комісія, можна поповнити онлайн. Потрібна картка Приватбанку.
- інші сайти - швидко, комісію порахувати важко, ненадійно. Підійде картка майже будь-якого банку, деякі онлайн-гаманці.
- comp&copy та термінали самообслуговування (не всі) - відносно швидко, без картки, проте комісія може сягати понад 20%.
- банк - мається на увазі платіж через банк, проходить чимало часу до зарахування, але комісія може бути меншою.
- сусіди/знайомі/тощо - переказ між акаунтами через особистий кабінет bill, комісія на час написання тексту нульова. Підходить для термінового поповнення інету в гуртожитку."""
BILL_PAY_CHECK = """Впевнені, тобі вдалося поповнити рахунок. Перевір баланс в особистому кабінеті на https://bill.univ.kiev.ua.
Кошти зараховані?"""
BILL_PAY_FAILED = """Трохи зачекай, перевір баланс знову: https://bill.univ.kiev.ua. Спробуй звернутися за контактами місця поповнення.
Якщо маєш чек, можеш показати його в ІОЦ. Напиши мапа аби дізнатися як знайти Інформаційно-обчислювальний центр.
Перенаправляємо у меню."""